rgon/smart-grind-by-weight/sdkconfig.defaults
# Enable performance optimizations, see https://github.com/espressif/esp-bsp/blob/master/components/esp_lvgl_port/docs/performance.md
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_FREERTOS_HZ=1000

# Use USB CDC console (equivalent to Arduino USB CDC on boot)
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

# Config board
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-S3 specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# PSRAM configuration
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y

# Bluetooth configuration - Switch to Bluedroid (closer to Arduino BLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BREDR_DISABLED=y

# LittleFS Configuration
CONFIG_LITTLEFS=y
CONFIG_LITTLEFS_SPIFFS_COMPAT=y
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_BLOCK_SIZE=4096